Repository: ElectroJK/recipe_recorder_app
Catalog: lib/l10n/intl_*.arb
Languages: kk

# appTitle
source: Recipe Recorder
kk: Рецепттер жазғышы

source: Settings
kk: Параметрлер

source: Theme
kk: Тақырып

source: Language
kk: Тіл

source: Light
kk: Жарық

source: Dark
kk: Қараңғы

source: System Default
kk: Жүйе тақырыбы

source: Light theme selected
kk: Жарық тақырып таңдалды

source: Dark theme selected
kk: Қараңғы тақырып таңдалды

source: System theme selected
kk: Жүйе тақырыбы таңдалды

source: English
kk: Ағылшын

source: Russian
kk: Орыс

source: Kazakh
kk: Қазақ

source: English selected
kk: Ағылшын тілі таңдалды

source: Russian selected
kk: Орыс тілі таңдалды

source: Kazakh selected
kk: Қазақ тілі таңдалды

# bottomNavHome
source: Home
kk: Басты бет

# bottomNavFavorites
source: Favorites
kk: Таңдаулылар

# bottomNavSettings
source: Settings
kk: Параметрлер

# settingsTitle
source: Settings
kk: Параметрлер

source: Change Language
kk: Тілді өзгерту

source: Change Theme
kk: Тақырыпты өзгерту

# recipeSpaghettiCarbonaraTitle
source: Spaghetti Carbonara
kk: Спагетти Карбонара

# recipeSpaghettiCarbonaraDescription
source: Creamy pasta with bacon and parmesan.
kk: Бекон және пармезан қосылған кремді паста.

# recipeChickenCurryTitle
source: Chicken Curry
kk: Тауық карри

# recipeChickenCurryDescription
source: Spicy Indian-style curry with chicken.
kk: Дәмді үнді стиліндегі тауық карри.

# recipeBeefStroganoffTitle
source: Beef Stroganoff
kk: Бефстроганов

# recipeBeefStroganoffDescription
source: Tender beef in mushroom cream sauce.
kk: Саңырауқұлақ тұздығындағы нәзік сиыр еті.

# recipeTunaSaladTitle
source: Tuna Salad
kk: Тунец салаты

# recipeTunaSaladDescription
source: Fresh and quick salad with tuna and veggies.
kk: Тунец пен көкөністер қосылған жеңіл салат.

# recipePancakesTitle
source: Pancakes
kk: Бәліштер

# recipePancakesDescription
source: Fluffy pancakes with maple syrup.
kk: Көкнәр шәрбатымен жұмсақ бәліштер.

# recipeTomatoSoupTitle
source: Tomato Soup
kk: Қызанақ сорпасы

# recipeTomatoSoupDescription
source: Warm soup with fresh tomatoes and herbs.
kk: Жаңа қызанақтар мен шөптер қосылған жылы сорпа.

# aboutUsTitle
source: About Us
kk: Біз туралы

# aboutRecipeRecorderTitle
source: About Recipe Recorder App
kk: Recipe Recorder қолданбасы туралы

# aboutRecipeRecorderContent
source: Recipe Recorder App helps users efficiently save and manage their favorite recipes. With an integrated database, users can securely store and access recipes anytime. The app also provides cooking tips and suggestions to enhance your culinary skills.
kk: Recipe Recorder қолданбасы пайдаланушыларға сүйікті рецептерін тиімді сақтауға және басқаруға көмектеседі. Интеграцияланған дерекқормен пайдаланушылар өздерінің рецепттерін қауіпсіз сақтап, кез келген уақытта қол жеткізе алады. Қолданба сонымен қатар ас үй дағдыларыңызды жақсартуға арналған кеңестер ұсынады.

# developersTitle
source: Developers
kk: Әзірлеушілер

# developersContent
source: Developed by: Tanatkanov Kadyrulan Asanali Ashimov Zholaman Yerzhan
kk: Әзірленген: Танатканов Кадырулан Асанали Ашимов Жоламан Ержан

# courseDetailsTitle
source: Course Details
kk: Курс туралы мәліметтер

# courseDetailsContent
source: Course: Crossplatform Development, Astana IT University Mentor: Assistant Professor Abzal Kyzyrkanov
kk: Курс: Кроссплатформалық әзірлеме, Астана IT университеті Ментор: доцент Абзал Кызырканов

# recipeTitle1
source: Spaghetti Carbonara
kk: Спагетти Карбонара

# recipeDescription1
source: Creamy pasta with bacon and parmesan.
kk: Бекон мен пармезан қосылған кремді макароны.

# recipeTitle2
source: Chicken Curry
kk: Тауық Карри

# recipeDescription2
source: Spicy Indian-style curry with chicken.
kk: Үнді стиліндегі тауық карри.

# recipeTitle3
source: Beef Stroganoff
kk: Биф Строганов

# recipeDescription3
source: Tender beef in mushroom cream sauce.
kk: Сливочном саусындағы жұмсақ сиыр еті.

# recipeTitle4
source: Tuna Salad
kk: Тунец салаты

# recipeDescription4
source: Fresh and quick salad with tuna and veggies.
kk: Тауық пен көкөністер қосылған жаңа және жылдам салат.

# recipeTitle5
source: Pancakes
kk: Панкейк

# recipeDescription5
source: Fluffy pancakes with maple syrup.
kk: Клен сиропы қосылған жұмсақ панкейк.

# recipeTitle6
source: Tomato Soup
kk: Томатты сорпа

# recipeDescription6
source: Warm soup with fresh tomatoes and herbs.
kk: Томат пен шөптер қосылған ыстық сорпа.

# addRecipe
source: Add New Recipe
kk: Жаңа рецепт қосу

# titleLabel
source: Title
kk: Атауы

# descriptionLabel
source: Description
kk: Сипаттамасы

# imageLabel
source: Image URL
kk: Сурет URL

# favoritesLabel
source: Favorites
kk: Таңдаулылар

source: Delete
kk: Жою

source: Cancel
kk: Бас тарту

source: Add
kk: Қосу

# deleteRecipeTitle
source: Delete recipe?
kk: Рецептті жою?

# deleteRecipeConfirmation
source: Are you sure you want to delete this recipe?
kk: Бұл рецептті жойғыңыз келетініне сенімдісіз бе?

source: {recipe} added to favorites
kk: {recipe} таңдаулыларға қосылды

source: {recipe} removed from favorites
kk: {recipe} таңдаулылардан өшірілді

# favoritesPageTitle
source: Favorites
kk: Таңдаулылар

# favoritesPageEmpty
source: No favorites yet!
kk: Таңдаулылар бос!

# profilePageTitle
source: Profile
kk: Жеке парақша

source: Logout
kk: Шығу

source: Error loading recipes
kk: Қате

source: Login
kk: Кіру

source: Register
kk: Тіркелу

source: Email
kk: Электрондық пошта

source: Password
kk: Құпиясөз

source: Confirm Password
kk: Құпиясөзді растаңыз

source: Username
kk: Пайдаланушы аты

# fillAllFields
source: Please fill in all fields
kk: Барлық өрістерді толтырыңыз

source: Passwords do not match
kk: Құпиясөздер сәйкес келмейді

# registrationSuccess
source: You have successfully registered
kk: Сіз сәтті тіркелдіңіз

source: Registration failed
kk: Тіркелу қатесі

source: Login failed
kk: Кіру қатесі

# dontHaveAccountRegister
source: Don't have an account? Register here
kk: Тіркелгіңіз жоқ па? Мұнда тіркеліңіз

source: Profile
kk: Профиль

source: Continue as Guest
kk: Қонақ ретінде кіру

# userNotLoggedIn
source: User is not logged in
kk: Пайдаланушы жүйеге кірмеген
